IDENTIFICATION DIVISION.
PROGRAM-ID. NUM-ASCII.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMERO   PIC 9(3).
01 WS-CHAR     PIC X.

PROCEDURE DIVISION.
    DISPLAY "Digite um numero (0-127): "
    ACCEPT WS-NUMERO

    IF WS-NUMERO > 127
       DISPLAY "Valor invalido! Use 0 a 127."
    ELSE
       MOVE FUNCTION CHAR(WS-NUMERO + 1) TO WS-CHAR
       DISPLAY "ASCII: " WS-CHAR
    END-IF

    STOP RUN.
